In [1]:
import pandas as pd

## bank scv src:https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv

In [2]:
df_titanic=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

## bank scv src:https://raw.githubusercontent.com/gnaneshgn/Ineuron-Assignments/main/data-sets/bank.csv

In [75]:
df_bank=pd.read_csv("https://raw.githubusercontent.com/gnaneshgn/Ineuron-Assignments/main/data-sets/bank.csv",sep=';')

In [4]:
#1.find out how many male and female on boarded
#2.how many survived we have 0-died,1-survived
#3. how many casuality we have
#4.what is the name of the person who is the eldest one
#5.how many passenger we have in first ,second, and third class
#6. how many passngers names start with S'
#7. Try to create a new colun which is summation of SibSP and parch
#8.how many below age 25
#9.how many died with age less than 40
#10.From Cabin seperate Text and number

In [5]:
#1.find out how many male on boarded
len(df_titanic[df_titanic['Sex']=='male'])

577

In [6]:
#1.find out how many  female on boarded
len(df_titanic[df_titanic['Sex']=='female'])

314

In [22]:
#2.how many survived we have 0-died,1-survived
len(df_titanic[df_titanic['Survived']==1])

342

In [23]:
#2.how many survived we have 0-died,1-survived
len(df_titanic[df_titanic['Survived']==0])

549

In [25]:
#4.what is the name of the person who is the eldest one
df_titanic[df_titanic['Age']==max(df_titanic['Age'])]['Name']

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

In [26]:
#5.how many passenger we have in first ,second, and third class
len(df_titanic[df_titanic['Pclass']==1])

216

In [27]:
#5.how many passenger we have in first ,second, and third class
len(df_titanic[df_titanic['Pclass']==2])

184

In [28]:
#5.how many passenger we have in first ,second, and third class
len(df_titanic[df_titanic['Pclass']==3])

491

In [29]:
#6. how many passngers names start with S'
l=[]
for i in df_titanic['Name']:
    if i.startswith("S") or i.startswith('s'):
        l.append(i)

In [14]:
len(l)

0

In [31]:
#7. Try to create a new colun which is summation of SibSP and parch
df_titanic['summation']=df_titanic['SibSp']+df_titanic['Parch']

In [32]:
#how many below age 25
len(df_titanic[df_titanic['Age']<25])

278

In [33]:
#9.how many died with age less than 40
len(df_titanic[(df_titanic['Survived']==0) & (df_titanic['Age']<40) ])

322

In [35]:
ind=df_titanic[df_titanic['Cabin'].notnull()].index

In [36]:
#10.From Cabin seperate Text and number
l1=[]
for i in df_titanic.iloc[ind]['Cabin']:
    if len(i)<5:
        l1.append(i)

In [37]:
alphabet=[]
numbers=[]
for j in l1:
    alphabet.append(j[:1])
    numbers.append(j[1:])

In [38]:
alphabet

['C',
 'C',
 'E',
 'G',
 'C',
 'D',
 'A',
 'B',
 'D',
 'B',
 'C',
 'B',
 'C',
 'F',
 'E',
 'A',
 'D',
 'C',
 'E',
 'D',
 'D',
 'C',
 'B',
 'F',
 'C',
 'E',
 'B',
 'A',
 'C',
 'F',
 'A',
 'F',
 'B',
 'B',
 'G',
 'A',
 'D',
 'D',
 'C',
 'C',
 'C',
 'D',
 'G',
 'C',
 'B',
 'E',
 'B',
 'C',
 'C',
 'C',
 'D',
 'A',
 'B',
 'D',
 'C',
 'E',
 'C',
 'E',
 'C',
 'C',
 'E',
 'C',
 'D',
 'B',
 'C',
 'C',
 'C',
 'E',
 'T',
 'F',
 'F',
 'C',
 'E',
 'D',
 'B',
 'E',
 'C',
 'D',
 'G',
 'C',
 'E',
 'C',
 'E',
 'A',
 'C',
 'C',
 'C',
 'E',
 'D',
 'E',
 'E',
 'D',
 'A',
 'B',
 'C',
 'B',
 'C',
 'D',
 'B',
 'C',
 'E',
 'D',
 'F',
 'B',
 'B',
 'C',
 'B',
 'B',
 'B',
 'C',
 'C',
 'A',
 'E',
 'C',
 'E',
 'E',
 'C',
 'A',
 'E',
 'B',
 'D',
 'A',
 'C',
 'F',
 'D',
 'D',
 'D',
 'A',
 'B',
 'B',
 'D',
 'A',
 'D',
 'E',
 'C',
 'B',
 'D',
 'B',
 'B',
 'C',
 'E',
 'E',
 'C',
 'C',
 'C',
 'C',
 'E',
 'E',
 'B',
 'B',
 'D',
 'C',
 'B',
 'D',
 'E',
 'B',
 'D',
 'E',
 'F',
 'B',
 'B',
 'D',
 'D',
 'A',
 'E',
 'B',
 'B',
 'E',
 'B',
 'E',
 'C',
 'C',
 'D',
 'E',
 'D',
 'A',
 'D',
 'C',
 'B',
 'C']

In [39]:
numbers

['85',
 '123',
 '46',
 '6',
 '103',
 '56',
 '6',
 '78',
 '33',
 '30',
 '52',
 '28',
 '83',
 '33',
 '31',
 '5',
 '26',
 '110',
 '101',
 '26',
 '47',
 '123',
 '86',
 '2',
 '2',
 '33',
 '19',
 '7',
 '49',
 '4',
 '32',
 '2',
 '4',
 '80',
 '6',
 '31',
 '36',
 '15',
 '93',
 '83',
 '78',
 '35',
 '6',
 '87',
 '77',
 '67',
 '94',
 '125',
 '99',
 '118',
 '7',
 '19',
 '49',
 '',
 '106',
 '101',
 '65',
 '36',
 '54',
 '7',
 '34',
 '32',
 '',
 '18',
 '124',
 '91',
 '2',
 '40',
 '',
 '2',
 '33',
 '128',
 '33',
 '37',
 '35',
 '50',
 '82',
 '36',
 '6',
 '78',
 '10',
 '52',
 '44',
 '34',
 '104',
 '111',
 '92',
 '38',
 '21',
 '12',
 '63',
 '',
 '14',
 '49',
 '93',
 '37',
 '30',
 '20',
 '79',
 '65',
 '25',
 '46',
 '33',
 '73',
 '18',
 '95',
 '38',
 '39',
 '22',
 '86',
 '70',
 '16',
 '67',
 '101',
 '25',
 '44',
 '68',
 '10',
 '68',
 '41',
 '20',
 '20',
 '125',
 '4',
 '19',
 '50',
 '9',
 '23',
 '50',
 '35',
 '33',
 '26',
 '48',
 '58',
 '126',
 '71',
 '49',
 '5',
 '20',
 '68',
 '24',
 '24',
 '90',
 '124',
 '126',
 '45',
 '101',
 '8',
 '5',
 '101',
 '45',
 '46',
 '22',
 '30',
 '121',
 '77',
 '11',
 '77',
 '38',
 '3',
 '20',
 '6',
 '17',
 '36',
 '8',
 '102',
 '69',
 '121',
 '28',
 '49',
 '47',
 '92',
 '28',
 '17',
 '17',
 '24',
 '35',
 '50',
 '42',
 '148']

## Bank tasks

In [76]:
#1 . how many campaign available in this dataset . 
df_bank.isnull().sum()

age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64

In [77]:
df_bank['campaign'].count()

4521

In [43]:
#2 . how many users do we have with housing and personal loan .

In [78]:
len(df_bank[(df_bank['housing']=='yes') & (df_bank['loan']=='yes')])

406

In [45]:
#3. how many person do we have whose age is 60+ .

In [79]:
len(df_bank[df_bank['age']>60])

127

In [47]:
#4 . in which month we have trageted most of the customer .

In [80]:
df_bank['month'].value_counts()

may    1398
jul     706
aug     633
jun     531
nov     389
apr     293
feb     222
jan     148
oct      80
sep      52
mar      49
dec      20
Name: month, dtype: int64

In [49]:
#5 . which mode of call is giving you more result

In [81]:
df_bank['contact'].value_counts()

cellular     2896
unknown      1324
telephone     301
Name: contact, dtype: int64

In [51]:
#6 . how many entrepreneur do we have in this list

In [82]:
len(df_bank[df_bank['job']=='entrepreneur'])

168

In [54]:
#7 . how many customers do we have with negative balance

In [83]:
len(df_bank[df_bank['balance']<0])

366

In [57]:
#8. prepare a group of data based on education level .

In [84]:
df_bank['education'].value_counts()

secondary    2306
tertiary     1350
primary       678
unknown       187
Name: education, dtype: int64

In [85]:
df_primary=df_bank[df_bank['education']=='primary']

In [86]:
df_secondary=df_bank[df_bank['education']=='secondary']

Empty DataFrame
Columns: [age, job, marital, education, default, balance, housing, loan, contact, day, month, duration, campaign, pdays, previous, poutcome, y]
Index: []

In [87]:
df_tertiary=df_bank[df_bank['education']=='tertiary']

In [88]:
df_unknown=df_bank[df_bank['education']=='unknown']

In [89]:
df_primary.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
9,43,services,married,primary,no,-88,yes,yes,cellular,17,apr,313,1,147,2,failure,no
18,25,blue-collar,single,primary,no,-221,yes,no,unknown,23,may,250,1,-1,0,unknown,no
26,55,blue-collar,married,primary,no,627,yes,no,unknown,5,may,247,1,-1,0,unknown,no
36,78,retired,divorced,primary,no,229,no,no,telephone,22,oct,97,1,-1,0,unknown,yes

In [90]:
df_secondary.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
7,39,technician,married,secondary,no,147,yes,no,cellular,6,may,151,2,-1,0,unknown,no
10,39,services,married,secondary,no,9374,yes,no,unknown,20,may,273,1,-1,0,unknown,no
11,43,admin.,married,secondary,no,264,yes,no,cellular,17,apr,113,2,-1,0,unknown,no

In [91]:
df_tertiary.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
5,35,management,single,tertiary,no,747,no,no,cellular,23,feb,141,2,176,3,failure,no
6,36,self-employed,married,tertiary,no,307,yes,no,cellular,14,may,341,1,330,2,other,no
8,41,entrepreneur,married,tertiary,no,221,yes,no,unknown,14,may,57,2,-1,0,unknown,no

In [92]:
df_unknown.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
20,38,management,divorced,unknown,no,0,yes,no,cellular,18,nov,96,2,-1,0,unknown,no
27,67,retired,married,unknown,no,696,no,no,telephone,17,aug,119,1,105,2,failure,no
49,61,admin.,married,unknown,no,4629,yes,no,cellular,27,jan,181,1,92,1,success,yes
132,43,blue-collar,married,unknown,yes,-715,yes,no,unknown,30,may,67,3,-1,0,unknown,no
133,48,admin.,married,unknown,no,0,yes,no,cellular,8,may,85,1,168,2,failure,no